Documents/СнятиеРезервов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СнятиеРезервов</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.Резервирование</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТабличнойЧасти</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТабличнойЧасти</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТабличнойЧасти</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТабличнойЧасти</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Резервирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Резервирование</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыРезервирований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТабличнойЧасти</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТабличнойЧасти</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СнятиеРезервов/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("МассивДокументов") И ДанныеЗаполнения.МассивДокументов.Количество() > 0 Тогда
			
			Если ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				ЗаполнитьПоРезервируемымДокументам(ДанныеЗаполнения.МассивДокументов);
			ИначеЕсли ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.Монтаж") Тогда
				ЗаполнитьПоРезервируемымДокументам(ДанныеЗаполнения.МассивДокументов);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		ЗаполнитьПоРезервируемымДокументам(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		
		ЗаполнитьПоРезервируемымДокументам(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Резервирование") Тогда
		
		ЗаполнитьПоДокументуРезервирование(ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//#12337
	Для Индекс = 0 по Товары.Количество()-1 Цикл
		СтрокаТабличнойЧасти = Товары[Индекс];
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаТабличнойЧасти.Номенклатура) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + Строка(Индекс+1) + " выбрана номенклатура-услуга", ЭтотОбъект, "Товары["+Формат(Индекс, "ЧГ=0")+"].Номенклатура", , Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ТоварыВРезервеНаСкладах.Записывать = Истина;
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Отказ = НЕ ПроверитьНаличиеРезервов(ОрганизацияТоваров);
	
	Если Отказ Тогда
		Возврат;
	Иначе
		Для Каждого Товар Из Товары Цикл
			
			Движение = Движения.ТоварыВРезервеНаСкладах.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Товар);
			
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ДокументРезерва = Товар.ДокументРезерва;
			Движение.Организация = ОрганизацияТоваров;
			Движение.Количество = Товар.Количество * Товар.Коэффициент;
			
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ЗаполнитьПоРезервируемымДокументам(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Контрагент 	= МассивДокументов[0].Контрагент;		
	Организация = МассивДокументов[0].Организация;	
	
	Для каждого ЭлементМассива из МассивДокументов Цикл
		
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
		Если Организация <> ЭлементМассива.Организация Тогда
			Текст = НСтр("ru = 'Организации в выделенных документах различаются, создание документа невозможно'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
		СписокКЗаполнению = ПолучитьСписокТоваровКЗаполнению(ЭлементМассива);
		
		Для Каждого ТекущаяСтрока Из СписокКЗаполнению Цикл
			
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.ДокументРезерва = ЭлементМассива;
			
		КонецЦикла;
		
	КонецЦикла;	
		
КонецПроцедуры

Процедура ЗаполнитьПоДокументуРезервирование(ДанныеЗаполнения)
	
	Контрагент 		= ДанныеЗаполнения.Контрагент;
	Организация 	= ДанныеЗаполнения.Организация;	
	
	ПозицииВРезерве = ПолучитьСписокТоваровКЗаполнению(ДанныеЗаполнения.ДокументРезерва);
	
	// Нужно по документу резервирования оставить только те позиции, которые сейчас в резерве (резерв - снятие с резерва)
			
	Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.Товары Цикл
		
		НайденнаяПозиция = ПозицииВРезерве.НайтиСтроки(
			новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент, Склад, ВидТабличнойЧасти"
			, ТекущаяСтрока.Номенклатура
			, ТекущаяСтрока.ХарактеристикаНоменклатуры
			, ТекущаяСтрока.СерияНоменклатуры
			, ТекущаяСтрока.ЕдиницаИзмерения
			, ТекущаяСтрока.Коэффициент
			, ДанныеЗаполнения.Склад
			, ТекущаяСтрока.ВидТабличнойЧасти)
		);
			
		Если НайденнаяПозиция.Количество() > 0 Тогда
		
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока,, "Количество");
			НоваяСтрока.Количество = Мин(ТекущаяСтрока.Количество, НайденнаяПозиция[0].Количество);
			НоваяСтрока.Склад = ДанныеЗаполнения.Склад;
			НоваяСтрока.ДокументРезерва = ДанныеЗаполнения.ДокументРезерва;
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПолучитьСписокТоваровКЗаполнению(ДанныеЗаполнения) Экспорт //nva
	
	// К заполнению возьмем все количество, которое было в резерве минус то что снято с резерва
	// Данные берем из документов, а не из регистров т.к. в разрезе единицы измерения
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РезервированиеТовары.Номенклатура,
		|	РезервированиеТовары.ХарактеристикаНоменклатуры,
		|	РезервированиеТовары.СерияНоменклатуры,
		|	РезервированиеТовары.ВидТабличнойЧасти,
		|	РезервированиеТовары.ЕдиницаИзмерения,
		|	РезервированиеТовары.Коэффициент,
		|	РезервированиеТовары.Ссылка.Склад КАК Склад,
		|	СУММА(РезервированиеТовары.Количество)
		|ПОМЕСТИТЬ ВТ_РезервированиеТовары
		|ИЗ
		|   Документ.Резервирование.Товары КАК РезервированиеТовары
		|ГДЕ
		|   РезервированиеТовары.Ссылка.Проведен
		|	И РезервированиеТовары.Ссылка.ДокументРезерва = &ДокументРезерва
		//#12337
		|	И НЕ РезервированиеТовары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
		|
		|СГРУППИРОВАТЬ ПО
		|	РезервированиеТовары.Номенклатура,
		|	РезервированиеТовары.ХарактеристикаНоменклатуры,
		|	РезервированиеТовары.СерияНоменклатуры,
		|	РезервированиеТовары.ВидТабличнойЧасти,
		|	РезервированиеТовары.ЕдиницаИзмерения,
		|	РезервированиеТовары.Коэффициент,
		|	РезервированиеТовары.Ссылка.Склад
		|;
		|///////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СнятиеРезервовТовары.Номенклатура,
		|	СнятиеРезервовТовары.ХарактеристикаНоменклатуры,
		|	СнятиеРезервовТовары.СерияНоменклатуры,
		|	СнятиеРезервовТовары.ВидТабличнойЧасти,
		|	СнятиеРезервовТовары.ЕдиницаИзмерения,
		|	СнятиеРезервовТовары.Коэффициент,
		|	СнятиеРезервовТовары.Склад,
		|	СУММА(СнятиеРезервовТовары.Количество)
		|ПОМЕСТИТЬ ВТ_СнятиеРезервовТовары
		|ИЗ
		|   Документ.СнятиеРезервов.Товары КАК СнятиеРезервовТовары
		|ГДЕ
		|   СнятиеРезервовТовары.Ссылка.Проведен
		|	И СнятиеРезервовТовары.ДокументРезерва = &ДокументРезерва
		|	И НЕ СнятиеРезервовТовары.Ссылка = &ТекущийДокумент
		//#12337
		|	И НЕ СнятиеРезервовТовары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
		|
		|СГРУППИРОВАТЬ ПО
		|	СнятиеРезервовТовары.Номенклатура,
		|	СнятиеРезервовТовары.ХарактеристикаНоменклатуры,
		|	СнятиеРезервовТовары.СерияНоменклатуры,
		|	СнятиеРезервовТовары.ВидТабличнойЧасти,
		|	СнятиеРезервовТовары.ЕдиницаИзмерения,
		|	СнятиеРезервовТовары.Коэффициент,
		|	СнятиеРезервовТовары.Склад
		|;
		|///////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РезервированиеТовары.Номенклатура,
		|	РезервированиеТовары.ХарактеристикаНоменклатуры,
		|	РезервированиеТовары.СерияНоменклатуры,
		|	РезервированиеТовары.ВидТабличнойЧасти,
		|	РезервированиеТовары.ЕдиницаИзмерения,
		|	РезервированиеТовары.Коэффициент,
		|	РезервированиеТовары.Склад,
		|	ЕСТЬNULL(РезервированиеТовары.Количество, 0) - ЕСТЬNULL(СнятиеРезервовТовары.Количество, 0) КАК Количество
		|ИЗ
		|   ВТ_РезервированиеТовары КАК РезервированиеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СнятиеРезервовТовары КАК СнятиеРезервовТовары
		|		ПО РезервированиеТовары.Номенклатура = СнятиеРезервовТовары.Номенклатура 
		|			И РезервированиеТовары.ХарактеристикаНоменклатуры = СнятиеРезервовТовары.ХарактеристикаНоменклатуры
		|			И РезервированиеТовары.СерияНоменклатуры = СнятиеРезервовТовары.СерияНоменклатуры
		|			И РезервированиеТовары.ЕдиницаИзмерения = СнятиеРезервовТовары.ЕдиницаИзмерения
		|			И РезервированиеТовары.Коэффициент = СнятиеРезервовТовары.Коэффициент
		|			И РезервированиеТовары.Склад = СнятиеРезервовТовары.Склад
		|			И РезервированиеТовары.ВидТабличнойЧасти = СнятиеРезервовТовары.ВидТабличнойЧасти
		|ГДЕ 
		|	(ЕСТЬNULL(РезервированиеТовары.Количество, 0) - ЕСТЬNULL(СнятиеРезервовТовары.Количество, 0)) > 0
		|";
	Запрос.УстановитьПараметр("ДокументРезерва", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПроверитьНаличиеРезервов(ОрганизацияТоваров)
	
	Результат = Истина;
	
	ВремТаблицаТовары = Новый ТаблицаЗначений;
	
	МассивТиповРезерва = новый Массив;
	МассивТиповРезерва.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	МассивТиповРезерва.Добавить(Тип("ДокументСсылка.Монтаж"));
	
	ВремТаблицаТовары.Колонки.Добавить("ДокументРезерва", новый ОписаниеТипов(МассивТиповРезерва));	
	ВремТаблицаТовары.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ВремТаблицаТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВремТаблицаТовары.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ВремТаблицаТовары.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ВремТаблицаТовары.Колонки.Добавить("Количество",Новый ОписаниеТипов("число"));
	ВремТаблицаТовары.Колонки.Добавить("Коэффициент",Новый ОписаниеТипов("число"));
	ВремТаблицаТовары.Колонки.Добавить("ВидТабличнойЧасти",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТабличнойЧасти"));
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		НоваяСтрока = ВремТаблицаТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
	ВремТаблицаТовары.Свернуть("ДокументРезерва, Склад, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, Коэффициент, ВидТабличнойЧасти", "Количество");
	
	Запрос = Новый Запрос;
	ВременныеТаблицы = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТовары.ДокументРезерва,
	|	ТаблицаТовары.Склад,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ТаблицаТовары.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ ВТ_ТаблицаТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТаблицаТовары.ДокументРезерва,
	|	ВТ_ТаблицаТовары.Склад,
	|	ВТ_ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВТ_ТаблицаТовары.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
	|	ВЫРАЗИТЬ(СУММА(ЕСТЬNULL(ВТ_ТаблицаТовары.Количество * ВТ_ТаблицаТовары.Коэффициент, 0)) КАК ЧИСЛО(15, 2)) КАК Количество
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	ВТ_ТаблицаТовары КАК ВТ_ТаблицаТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаТовары.ДокументРезерва,
	|	ВТ_ТаблицаТовары.Склад,
	|	ВТ_ТаблицаТовары.Номенклатура,
	|	ВТ_ТаблицаТовары.ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаТовары.СерияНоменклатуры,
	|	ВТ_ТаблицаТовары.ВидТабличнойЧасти
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокСписания.ДокументРезерва,
	|	ДокСписания.Склад,
	|	ДокСписания.Номенклатура КАК Номенклатура,
	|	ДокСписания.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДокСписания.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДокСписания.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
	|	ДокСписания.Количество КАК Количество,
	|	ЕСТЬNULL(ВРезервеОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	ТаблицаТовары КАК ДокСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				&ТекДата,				
	|					Организация = &Организация
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ДокСписания.Номенклатура
	|						ИЗ
	|							ТаблицаТовары КАК ДокСписания)
	|					И ХарактеристикаНоменклатуры В
	|						(ВЫБРАТЬ
	|							ДокСписания.ХарактеристикаНоменклатуры
	|						ИЗ
	|							ТаблицаТовары КАК ДокСписания)
	|					И СерияНоменклатуры В
	|						(ВЫБРАТЬ
	|							ДокСписания.СерияНоменклатуры
	|						ИЗ
	|							ТаблицаТовары КАК ДокСписания)) КАК ВРезервеОстатки
	|		ПО (ВРезервеОстатки.Номенклатура = ДокСписания.Номенклатура)
	|			И (ВРезервеОстатки.ХарактеристикаНоменклатуры = ДокСписания.ХарактеристикаНоменклатуры)
	|			И (ВРезервеОстатки.СерияНоменклатуры = ДокСписания.СерияНоменклатуры)
	|			И (ВРезервеОстатки.ДокументРезерва = ДокСписания.ДокументРезерва)
	|			И (ВРезервеОстатки.Склад = ДокСписания.Склад)
	|			И (ВРезервеОстатки.ВидТабличнойЧасти = ДокСписания.ВидТабличнойЧасти)
	|";
		
	Запрос.УстановитьПараметр("ТекДата", Дата);
	Запрос.УстановитьПараметр("Организация", ОрганизацияТоваров);
	Запрос.УстановитьПараметр("ТаблицаТовары", ВремТаблицаТовары);
	
	ВыборкаСписание = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСписание.Следующий() Цикл
		Если ВыборкаСписание.КоличествоОстаток < ВыборкаСписание.Количество Тогда
			Сообщить("Снимается с резерва " + ВыборкаСписание.Номенклатура + ?(ВыборкаСписание.ХарактеристикаНоменклатуры.Пустая(),"",", Характеристика: " + ВыборкаСписание.ХарактеристикаНоменклатуры) + ?(ВыборкаСписание.СерияНоменклатуры.Пустая(),"",", Серия: " + ВыборкаСписание.СерияНоменклатуры) + ", по документу: " + ВыборкаСписание.ДокументРезерва + " в количестве = " + ВыборкаСписание.Количество + ", остаток в резерве = " + ВыборкаСписание.КоличествоОстаток, СтатусСообщения.Важное);
			Результат = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
